ethan-almeida/MobileToolAssistant/DWM1000_tests/stm32/final/robot_end_rtos/Core/Src/dwm1000.c
///*
// * dwm1000.c
// *
// *  Created on: Feb 16, 2026
// *      Author: Aneek Mubarak
// */
//
//
#include "dwm1000.h"
#include "main.h"
#include "stm32f4xx_hal.h"

#define MSG_TYPE_POLL 0xA1
#define MSG_TYPE_POLL_2 0xA2
#define MSG_TYPE_RESPONSE 0xB2
#define MSG_TYPE_FINAL 0xA3

#define DWT_TIME_UNITS (1.0 / (499.2e6 * 128.0))
#define US_TO_DWT(us) ((uint64_t)((us) / (DWT_TIME_UNITS * 1e6)))

extern SPI_HandleTypeDef hspi1;

//static robot_state_t robot_state = ROBOT_SEND_POLL;
static uint8_t retries = 0;
#define MAX_RETRIES 3

//#define ANTENNA_DELAY 32000ULL
#define ANTENNA_DELAY 32835.0   // calibrated at 0.4m

static robot_state_t robot_state = RSTATE_SEND_POLL;


void dwm_reset(DWM_Module *module) {
    HAL_GPIO_WritePin(module->reset_port, module->reset_pin, GPIO_PIN_RESET);
//    HAL_Delay(1);  // 1 ms minimum
    osDelay(1);

    // Release  to Hi-Z because open-drain
    HAL_GPIO_WritePin(module->reset_port, module->reset_pin, GPIO_PIN_SET);
//    HAL_Delay(10); // Allow DW1000 to boot
    osDelay(1);
}


//void dwm_read_reg(DWM_Module *module, uint8_t reg_id, uint8_t *data, uint16_t len) {
//    uint8_t tx[1 + len];
//    uint8_t rx[1 + len];
//
//    tx[0] = reg_id & 0x3F;
//
//    memset(&tx[1], 0, len);
//
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
//    HAL_SPI_TransmitReceive(&hspi1, tx, rx, 1 + len, HAL_MAX_DELAY);
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
//
//    memcpy(data, &rx[1], len);
//}

void dwm_read_reg(DWM_Module *module, uint8_t reg_id, uint8_t *data, uint16_t len)
{
    uint8_t header = reg_id & 0x3F;

    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);

    HAL_SPI_Transmit(&hspi1, &header, 1, HAL_MAX_DELAY);
    HAL_SPI_Receive(&hspi1, data, len, HAL_MAX_DELAY);

    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
}





////
//void dwm_write_reg(DWM_Module *module, uint8_t reg_id, uint8_t *data, uint8_t len) {
//    uint8_t tx[1 + len];
//    tx[0] = 0x80 | (reg_id & 0x3F);
//
//    memcpy(&tx[1], data, len);
//
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
//    HAL_SPI_Transmit(&hspi1, tx, 1 + len, HAL_MAX_DELAY);
//
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
//}

void dwm_write_reg(DWM_Module *module, uint8_t reg_id, uint8_t *data, uint8_t len) {
    uint8_t header = 0x80 | (reg_id & 0x3F);
    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
    // Sed header
    HAL_SPI_Transmit(&hspi1, &header, 1, HAL_MAX_DELAY);
    // Send payload directly from caller buffer
    if (len > 0)
    {
        HAL_SPI_Transmit(&hspi1, data, len, HAL_MAX_DELAY);
    }

    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
}




void dwm_write_reg_sub(DWM_Module *module, uint8_t reg_id, uint16_t subaddr, uint8_t *data, uint16_t len) {

	uint8_t header[3];
    uint8_t header_len = 1;

    //first header byte - write + reg ID
    header[0] = 0x80 | (reg_id & 0x3F);

    if (subaddr != 0xFFFF) {  // sentinel = no subaddr
        header[0] |= 0x40;    // subaddress flag

        header[1] = subaddr & 0x7F;
        header_len = 2;

        if (subaddr > 0x7F) {
            header[1] |= 0x80;
            header[2] = (subaddr >> 7) & 0xFF;
            header_len = 3;
        }
    }

    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, header, header_len, HAL_MAX_DELAY);
    HAL_SPI_Transmit(&hspi1, data, len, HAL_MAX_DELAY);
    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
}


void dwm_read_reg_sub(DWM_Module *module,uint8_t reg_id, uint16_t subaddr, uint8_t *data, uint16_t len) {

	uint8_t header[3];
    uint8_t header_len = 1;

    header[0] = reg_id & 0x3F;

    if (subaddr != 0xFFFF) {
        header[0] |= 0x40;

        header[1] = subaddr & 0x7F;
        header_len = 2;

        if (subaddr > 0x7F) {
            header[1] |= 0x80;
            header[2] = subaddr >> 7;
            header_len = 3;
        }
    }

    //combine header + dummy
    uint8_t tx[header_len + len];
    uint8_t rx[header_len + len];

    memcpy(tx, header, header_len);
    memset(tx + header_len, 0, len);

    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
    HAL_SPI_TransmitReceive(&hspi1, tx, rx, header_len + len, HAL_MAX_DELAY);
    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);

    memcpy(data, rx + header_len, len);
}


//void dwm_read_reg_sub(DWM_Module *module,uint8_t reg_id, uint16_t subaddr, uint8_t *data, uint16_t len) {
//
//    uint8_t header[3];
//    uint8_t header_len = 1;
//
//    // First header byte (READ)
//    header[0] = reg_id & 0x3F;
//
//    if (subaddr != 0xFFFF)
//    {
//        header[0] |= 0x40;  // subaddress flag
//
//        if (subaddr <= 0x7F)
//        {
//            header[1] = subaddr & 0x7F;
//            header_len = 2;
//        }
//        else
//        {
//            header[1] = (subaddr & 0x7F) | 0x80;
//            header[2] = (subaddr >> 7) & 0xFF;
//            header_len = 3;
//        }
//    }
//
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_RESET);
//
//    // Send header
//    HAL_SPI_Transmit(&hspi1, header, header_len, HAL_MAX_DELAY);
//
//    // Read data directly into user buffer
//    if (len > 0)
//    {
//        uint8_t dummy_tx = 0x00;
//        for (uint16_t i = 0; i < len; i++)
//        {
//            HAL_SPI_TransmitReceive(&hspi1,&dummy_tx, &data[i],1, HAL_MAX_DELAY);
//        }
//    }
//
//    HAL_GPIO_WritePin(module->cs_port, module->cs_pin, GPIO_PIN_SET);
//}




void dwm_configure(DWM_Module* module){

	//1. AGC Tune1 - 2 octets
	uint8_t current_agc1_config[2] = {0};
	dwm_read_reg_sub(module,0x23,0x04,current_agc1_config,2);

	current_agc1_config[0] = 0x70;
	current_agc1_config[1] = 0x88;

	dwm_write_reg_sub(module, 0x23,0x04,current_agc1_config,2);
	dwm_read_reg_sub(module, 0x23,0x04,current_agc1_config,2);


