ethan-almeida/MobileToolAssistant/DWM1000_tests/stm32/final/robot_end_rtos/Core/Src/dwm1000.c
    return false;

}

//------------------
// Two Way Ranging
//-------------------
// use 0x17 for TX_time and 0x15 for Rx_time
uint64_t read_timestamp(DWM_Module* module,uint8_t reg)
{
    uint8_t ts[5];
    dwm_read_reg_sub(module, reg, 0x00, ts, 5);

    uint64_t value = 0;
    for (int i = 4; i >= 0; i--) {
        value = (value << 8) | ts[i];
    }

    return value;
}

uint64_t ts_diff(uint64_t a, uint64_t b)
{
    //handle wraparound
    const uint64_t MASK = ((uint64_t)1 << 40) - 1;
    return (a - b) & MASK;
}



int send_frame(DWM_Module* module, uint8_t* payload, uint8_t len)
{
    // write to TX buffer
    dwm_write_reg(module, 0x09, payload, len);

    // configure TX_FCTRL
    uint8_t tx_frame_control[5] = {0};
    dwm_read_reg(module, 0x08, tx_frame_control, 5);

    tx_frame_control[0] &= 0x80;
    tx_frame_control[0] |= (len + 2); // include CRC

//    // NEW
//    // Set PRF to 64Mhz (comment out for 16Mhz)
//    tx_frame_control[1] &= 0b11001111;
//    tx_frame_control[1] |= 0b00100000;


    dwm_write_reg(module, 0x08, tx_frame_control, 5);

    // trigger TX
    uint8_t sys_ctrl[4] = {0};
    dwm_read_reg(module, 0x0D, sys_ctrl, 4);
    sys_ctrl[0] |= (1 << 1); // TXSTRT
    dwm_write_reg(module, 0x0D, sys_ctrl, 4);


//    uint8_t sys_event_status_reg[5] = {0};
//
//    osDelay(3);
//
//    dwm_read_reg(module, 0x0f, sys_event_status_reg, 5);
//
//    if(!(sys_event_status_reg[0]&0x80)){
//    	return 0;
//    }
//
//    uint8_t clear[5] = {0};
//    clear[0] = 0x80;  // TXFRS
//    clear[1] = 0xF0;  // clear RXFCE, RXRFTO, RXPTO etc
//    dwm_write_reg(module, 0x0F, clear, 5);
//
//    return 1; // success


    uint8_t sys_status[5];
    int timeout = 10000;

    while(timeout--)
    {
        dwm_read_reg(module, 0x0F, sys_status, 5);
        if(sys_status[0] & 0x80)  // TXFRS
            break;
    }

    if(!(sys_status[0] & 0x80))
        return 0;   // timeout

    uint8_t clear[5] = {0};
    clear[0] = 0x80;
    dwm_write_reg(module, 0x0F, clear, 5);



    return 1;
}


bool process_response(uint8_t *rx_buffer, uint16_t len, uint64_t *treply_out)
{
    if (len < 6)
        return false;

    //Check message type
    if (rx_buffer[0] != MSG_TYPE_RESPONSE)
        return false;

    //Reconstruct 40-bit little-endian timestamp
    uint64_t treply = 0;

    for (int i = 0; i < 5; i++)
    {
        treply |= ((uint64_t)rx_buffer[1 + i]) << (8 * i);
    }

    *treply_out = treply;

    return true;
}


bool process_response_2(uint8_t *rx_buffer, uint16_t len, uint64_t *treply_out)
{
    if (len < 6)
        return false;

    //Check message type
    if (rx_buffer[0] != MSG_TYPE_FINAL)
        return false;

    //Reconstruct 40-bit little-endian timestamp
    uint64_t treply = 0;

    for (int i = 0; i < 5; i++)
    {
        treply |= ((uint64_t)rx_buffer[1 + i]) << (8 * i);
    }

    *treply_out = treply;

    return true;
}



//void start_ranging(DWM_Module* module, uint64_t* distance, uint64_t* t_prop, uint64_t* t_reply){
//
//    static int receive = 0;
//    static int sent = 0;
////    uint64_t t_reply = 0; /// de.lay time of the remote
//    static uint64_t tx_timestamp = 0;
//    static uint64_t rx_timestamp = 0;
//    uint64_t  distance_cm = 0;
//
//
////    uint8_t sys_ctrl_reg[4] = {0};
//
//    uint8_t rx_buff[6];
//    uint8_t tx_buff[4] = {0xAA, 0xBB, 0xCC, 0xEE};
//
//    if(!sent){
//        sent = send_frame(module, tx_buff, 4);
//
//        if(sent){
//
//        	// save timestamp
//            // ENABLE Rx
//        	tx_timestamp = read_timestamp(module, 0x17);
////            dwm_read_reg(module, 0x0D, sys_ctrl_reg, 4);
//            uint8_t sys_ctrl_reg[4] = {0};
//            sys_ctrl_reg[1] |= (1 << 0); // RXENAB
//            dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);
//        }
//    }
//    else if(sent && !receive){
//        if(dwm_receive(module, rx_buff, 6)){
//            receive = 1;
//            rx_timestamp = read_timestamp(module, 0x15);
//            process_response(rx_buff,6, t_reply);
//
//        }
//    }
//
//    if(sent && receive){
//    	// done
//    	uint64_t t_rtt = ts_diff(rx_timestamp,tx_timestamp);
//
////    	uint64_t t_prop = 0.5*(t_rtt - t_reply);
////    	uint64_t t_prop = (t_rtt - t_reply) >> 1;
//    	if (t_rtt > *t_reply) {
//    	    *t_prop = (t_rtt - *t_reply) >> 1;
//
//    	    if (*t_prop > ANTENNA_DELAY)
//    	    {
//    	        *t_prop -= ANTENNA_DELAY;
//    	    }
////    	    distance_cm = (t_prop * 469176) / 1000000;
//    	    distance_cm = (*t_prop * 469176ULL) / 1000000ULL;
////    	    distance_cm = (*t_prop * 469176ULL) / 1000000ULL;
////    	    *distance = distance_cm;
//
//    	    uint64_t offset = 360;
//    	    *distance = distance_cm-offset;;
//
//    	}
//
//
//        // reset for next round
//        sent = 0;
//        receive = 0;
//    }
//}


bool robot_ranging_step(DWM_Module* module, uint64_t* distance_cm_out)
{
    static uint64_t t_tx_poll = 0;
    static uint64_t t_rx_resp = 0;
    static uint64_t t_reply_1 = 0;

    static uint64_t t_tx_poll_2 = 0;
    static uint64_t t_rx_resp_2 = 0;
    static uint64_t t_reply_2 = 0;


    uint8_t rx_buff[6];

    switch(robot_state)
    {
        //*******************************************
        case RSTATE_SEND_POLL:
        {
            // Try sending poll frame
            uint8_t poll_frame[6] = {MSG_TYPE_POLL, 0,0,0,0,0};

            if (!send_frame(module, poll_frame, 6)) {
                // send failed; retry a few times
                robot_state = RSTATE_ERROR_RECOVERY;
                return false;
            }

            // Save TX timestamp immediately
            t_tx_poll = read_timestamp(module, 0x17);

            // enable receiver
            uint8_t sys_ctrl_reg[4] = {0};
            sys_ctrl_reg[1] |= (1 << 0); // RXENAB
            dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);

            // Go to receiving state
            robot_state = RSTATE_WAIT_RESPONSE_1;


            break;
        }

