ethan-almeida/MobileToolAssistant/DWM1000_tests/stm32/final/robot_end_rtos/Core/Src/dwm1000.c
        //***********************888
//        case RSTATE_WAIT_RESPONSE_1:
//        {
//        	// get the first responcse and record t_reply1
//            // Try receive with timeout
//            if (dwm_receive(module, rx_buff, 6)) {
//
//                // Check response contents
//                if (!process_response(rx_buff, 6, &t_reply_1)) {
//                    // Bad response format
//                    robot_state = RSTATE_ERROR_RECOVERY;
//                    return false;
//                }
//
//                // Save RX time
//                t_rx_resp = read_timestamp(module, 0x15);
//
////                // Compute range
////                robot_state = RSTATE_COMPUTE;
//
//                // send poll 2
//                robot_state = RSTATE_SEND_POLL_2;
//            }else{
//            	robot_state = RSTATE_ERROR_RECOVERY;
//            }
//            break;
//        }

        case RSTATE_WAIT_RESPONSE_1:
        {
            if (dwm_receive(module, rx_buff, 6)) {
            	if (!process_response(rx_buff, 6, &t_reply_1)) {
                    robot_state = RSTATE_ERROR_RECOVERY;
                    return false;
                }
                t_rx_resp = read_timestamp(module, 0x15);

                // ===== SEND POLL_2 IMMEDIATELY — DO NOT RETURN =====

                // Force IDLE first (critical after RX)
                uint8_t trxoff[4] = {0};
                trxoff[0] = (1 << 6);  // TRXOFF
                dwm_write_reg(module, 0x0D, trxoff, 4);

                // Clear all status
                uint8_t clearall[5] = {0};
                dwm_read_reg(module,0x0F,clearall,5);
                dwm_write_reg(module, 0x0F, clearall, 5);

                // Send Poll_2
                uint8_t poll_frame[6] = {MSG_TYPE_POLL_2, 0,0,0,0,0};
                if (!send_frame(module, poll_frame, 6)) {
                    robot_state = RSTATE_ERROR_RECOVERY;
                    return false;
                }

                t_tx_poll_2 = read_timestamp(module, 0x17);

                // Enable RX for Final
                uint8_t sys_ctrl_reg[4] = {0};
                sys_ctrl_reg[1] = (1 << 0); // RXENAB
                dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);

                robot_state = RSTATE_WAIT_RESPONSE_2;
            } else {
                robot_state = RSTATE_ERROR_RECOVERY;
            }
            break;
        }


        //**** NEW : FOR DS TWR stuff ********

        case RSTATE_SEND_POLL_2:
        {


            // Try sending poll frame
            uint8_t poll_frame[6] = {MSG_TYPE_POLL_2, 0,0,0,0,0};


            if (!send_frame(module, poll_frame, 6)) {
                // send failed; retry a few times
                robot_state = RSTATE_ERROR_RECOVERY;
                return false;
            }

            // Save TX timestamp immediately
            t_tx_poll_2 = read_timestamp(module, 0x17);


            // enable receiver to get the final response

            uint8_t clear[5] = {0};
            clear[0] = 0x80;
            dwm_write_reg(module, 0x0F, clear, 5);

            uint8_t sys_ctrl_reg[4] = {0};
            sys_ctrl_reg[1] |= (1 << 0); // RXENAB
            dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);

            // Go to receiving state
            robot_state = RSTATE_WAIT_RESPONSE_2;


            break;
        }

        //*****************************
        case RSTATE_WAIT_RESPONSE_2:
        {
        	// get the first responcse and record t_reply1
            // Try receive with timeout
            if (dwm_receive(module, rx_buff, 6)) {

                // Check response contents
                if (!process_response_2(rx_buff, 6, &t_reply_2)) {
                    // Bad response format
                    robot_state = RSTATE_ERROR_RECOVERY;
                    return false;
                }

                // Save RX time
                t_rx_resp_2 = read_timestamp(module, 0x15);

//                // Compute range
//                robot_state = RSTATE_COMPUTE;

                //compute
                robot_state = RSTATE_COMPUTE;
            }else{
            	robot_state = RSTATE_ERROR_RECOVERY;
            }
            break;
        }

        // ****************************
//        case RSTATE_COMPUTE:
//        {
//            // Compute RTT, propagation
//            uint64_t t_rtt = ts_diff(t_rx_resp, t_tx_poll);
//
//            if (t_rtt <= t_reply_1) {
//                // impossible -- clock or receive error
//                robot_state = RSTATE_ERROR_RECOVERY;
//                return false;
//            }
//
//            uint64_t t_prop = (t_rtt - t_reply_1) >> 1; // div by 2
//            if (t_prop > ANTENNA_DELAY) {
//                t_prop -= ANTENNA_DELAY;
//            }
//
//            uint64_t distance = (t_prop * 469176ULL) / 1000000ULL;
//
//            // Output
//            *distance_cm_out = distance-300;
//
//            // Next poll
//            robot_state = RSTATE_SEND_POLL;
//            return true; // means new distance is available
//        }
        case RSTATE_COMPUTE:
        {
            uint64_t t_rtt_1  = ts_diff(t_rx_resp,   t_tx_poll);
            uint64_t t_rtt_2  = ts_diff(t_rx_resp_2, t_tx_poll_2);

            // DS-TWR: t_prop = (rtt1*rtt2 - reply1*reply2) / (rtt1+rtt2+reply1+reply2)
            double rtt1   = (double)t_rtt_1;
            double rtt2   = (double)t_rtt_2;
            double reply1 = (double)t_reply_1;
            double reply2 = (double)t_reply_2;

            double t_prop = (rtt1 * rtt2 - reply1 * reply2)
                          / (rtt1 + rtt2 + reply1 + reply2);


            t_prop -= ANTENNA_DELAY;
            if (t_prop < 0) {
                robot_state = RSTATE_ERROR_RECOVERY;
                return false;
            }

            double distance_m = t_prop * DWT_TIME_UNITS * 299792458.0;
            *distance_cm_out = (uint64_t)(distance_m * 100.0);

            robot_state = RSTATE_SEND_POLL;
            return true;
        }

        // --------------------------------------------------------------------
        case RSTATE_ERROR_RECOVERY:
        {
            // Abort any pending operation
            uint8_t sys_ctrl[4] = {0};
            sys_ctrl[0] |= (1 << 6);  // TRXOFF
            dwm_write_reg(module, 0x0D, sys_ctrl, 4);

            // Clear all status (including HPDWARN)
            uint8_t clear[5] = {0};
            dwm_read_reg(module, 0x0F, clear, 5);
            dwm_write_reg(module, 0x0F, clear, 5);
            // Reset state, maybe increment retry counters
            robot_state = RSTATE_SEND_POLL;
            return false;
        }
    }

    return false;  // no new valid distance yet
}

